Revit 2026 API

# ElementMulticlassFilter Class

---

A filter used to match elements by their class, where more than one class of element may be passed.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBElementMulticlassFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementMulticlassFilter : ElementQuickFilter
```
```vb
Public Class ElementMulticlassFilter
	Inherits ElementQuickFilter
```
```cpp
public ref class ElementMulticlassFilter : public ElementQuickFilter
```
```fsharp
type ElementMulticlassFilter =
    class
        inherit ElementQuickFilter
    end
```

The ElementMulticlassFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementMulticlassFilter(IListType) | Initializes a new instance of the ElementMulticlassFilter class |
|  | ElementMulticlassFilter(IListType, Boolean) | Initializes a new instance of the ElementMulticlassFilter class |

|  | Name | Description |
| --- | --- | --- |
|  | Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted. (Inherited from ElementFilter) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ElementFilter) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from ElementFilter) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | PassesFilter(Element) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | PassesFilter(Document, ElementId) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

Only elements whose class is an exact match to one of the input classes, or elements whose type is derived from the input class will pass the collector.

There is a small subset of Element subclasses in the API that are not supported by this filter. These classes exist in the API, but not in Revit's native object model, which means that this filter doesn't support them. In order to use a class filter to find elements of these types, it is necessary to use a higher level class and then process the results further to find elements matching only the subclass. For a list of subclasses affected by this restriction, consult the documentation for [!:Autodesk::Revit::DB::ElementClassFilter].

#### Reference

Autodesk.Revit.DB Namespace